export const gameTheme: string[] = [
  "家にあるもの",
  "曲名",
  "虫の名前",
  "病気の名前",
  "植物の名前",
  "生き物の名前",
  "乗り物の名前",
  "文房具の名前",
  "任天堂のキャラクター",
  "食べ物・飲み物",
  "ポケモンの名前",
  "ポケモンの技名",
  "有名企業の名前",
  "キャラクターの名前",
  "アニメ・漫画のタイトル",
  "賢そうな単語"
];

export const hiraganas: string[][] = [
  ["や", "ら", "ま", "は", "な", "た", "さ", "か", "あ"],
  ["ゆ", "り", "み", "ひ", "に", "ち", "し", "き", "い"],
  ["よ", "る", "む", "ふ", "ぬ", "つ", "す", "く", "う"],
  ["わ", "れ", "め", "へ", "ね", "て", "せ", "け", "え"],
  ["ん", "ろ", "も", "ほ", "の", "と", "そ", "こ", "お"]
];

export const paintedPlayer: number[][] = [
  [0, 0, 0, 0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0, 0, 0, 0]
];

export const playerNames: string[] = ["プレイヤー1", "プレイヤー2", "プレイヤー3", "プレイヤー4"];

export interface answerArray {
  player: string;
  answer: string;
  point: number;
}

export const answerQueue: answerArray[] = [];

export const gameResultModalContent = (
  <>
    <h2>ゲーム終了！</h2>
    <p>結果発表画面に移ります</p>
    <br />
  </>
);

export const ruleModalContent = (
  <>
    <h2>ルール説明</h2>
    <li>自分の順番がきたら、お題に則った言葉を「ひらがな」で入力します。</li>
    <li>1文字も埋まらない言葉はNGです。</li>
    <li>伸ばし棒はカウントしません。</li>
    <li>大文字と小文字は同じ文字として扱います。（例: や＝ゃ　つ＝っ）</li>
    <li>濁点と半濁点は無視して扱います。（例: は＝ば＝ぱ）</li>
    <br />
  </>
);
