export const gameTheme: string[] = [
  "家にあるもの",
  "曲名",
  "虫の名前",
  "病気の名前",
  "植物の名前",
  "生き物の名前",
  "乗り物の名前",
  "文房具の名前",
  "任天堂のキャラクター",
  "食べ物・飲み物",
  "ポケモンの名前",
  "ポケモンの技名",
  "有名企業の名前",
  "キャラクターの名前",
  "アニメ・漫画のタイトル",
  "賢そうな単語"
];

export const hiraganas: string[][] = [
  ["や", "ら", "ま", "は", "な", "た", "さ", "か", "あ"],
  ["ゆ", "り", "み", "ひ", "に", "ち", "し", "き", "い"],
  ["よ", "る", "む", "ふ", "ぬ", "つ", "す", "く", "う"],
  ["わ", "れ", "め", "へ", "ね", "て", "せ", "け", "え"],
  ["ん", "ろ", "も", "ほ", "の", "と", "そ", "こ", "お"]
];

export const paintedPlayer: number[][] = [
  [0, 0, 0, 0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0, 0, 0, 0]
];
